import "./globals.css";
import "slick-carousel/slick/slick.css";
import "slick-carousel/slick/slick-theme.css";
import Bar from "./_compoents/bar/page";
import Footer from "./_compoents/footer/page";


export const metadata = {
  title: "مركز صيانة لاجهزة سميج الخط الساخن 16062",
  description: "مركز صيانة سميج 16062 يقدم خدمات صيانة شاملة لأجهزة سميج، بما في ذلك صيانة بوتاجاز سميج، فرن سميج، ميكروويف سميج، ثلاجة سميج، غسالة سميج، وغسالة أطباق سميج. نحن نعمل على توفير خدمة عملاء متميزة ودعم فني سريع وفعال، مع إمكانية تصليح أجهزة سميج وتوفير قطع غيار أصلية. اعتمد علينا للحصول على خدمات صيانة منزلية موثوقة واحترافية. اتصل بنا اليوم لنساعدك في حل جميع مشاكل الأجهزة الكهربائية الخاصة بك.",
  keywords: "صيانة بوتاجاز سميج, رقم صيانة بوتاجازات سميج, الخط الساخن بوتاجاز سميج, توكيل بوتاجاز سميج, مركز صيانة بوتاجازات سميج, خدمة العملاء بوتاجاز سميج, ضمان بوتاجاز سميج, تصليح بوتاجازات سميج, قطع غيار بوتاجازات سميج, تنظيف بوتاجاز سميج, مشاكل بوتاجاز سميج, استبدال قطع بوتاجاز سميج, صيانة دورية لبوتاجاز سميج, صيانة فرن سميج, رقم صيانة أفران سميج, الخط الساخن فرن سميج, توكيل فرن سميج, مركز صيانة أفران سميج, خدمة العملاء فرن سميج, ضمان فرن سميج, تصليح أفران سميج, قطع غيار أفران سميج, مشاكل فرن سميج, تنظيف فرن سميج, صيانة أفران سميج الكهربائية, استبدال قطع فرن سميج, صيانة ميكروويف سميج, رقم صيانة ميكروويفات سميج, الخط الساخن ميكروويف سميج, توكيل ميكروويف سميج, مركز صيانة ميكروويفات سميج, خدمة العملاء ميكروويف سميج, ضمان ميكروويف سميج, تصليح ميكروويفات سميج, قطع غيار ميكروويف سميج, مشاكل ميكروويف سميج, تنظيف ميكروويف سميج, صيانة ميكروويف سميج المنزلي, استبدال قطع ميكروويف سميج, صيانة ثلاجة سميج, رقم صيانة ثلاجات سميج, الخط الساخن ثلاجة سميج, توكيل ثلاجة سميج, مركز صيانة ثلاجات سميج, خدمة العملاء ثلاجة سميج, ضمان ثلاجة سميج, تصليح ثلاجات سميج, قطع غيار ثلاجات سميج, مشاكل ثلاجة سميج, تنظيف ثلاجة سميج, صيانة ثلاجات سميج المنزلية, استبدال قطع ثلاجة سميج, صيانة غسالة سميج, رقم صيانة غسالات سميج, الخط الساخن غسالة سميج, توكيل غسالة سميج, مركز صيانة غسالات سميج, خدمة العملاء غسالة سميج, ضمان غسالة سميج, تصليح غسالات سميج, قطع غيار غسالات سميج, مشاكل غسالة سميج, تنظيف غسالة سميج, صيانة غسالات سميج الأوتوماتيكية, استبدال قطع غسالة سميج, صيانة غسالة أطباق سميج, رقم صيانة غسالات أطباق سميج, الخط الساخن غسالة أطباق سميج, توكيل غسالة أطباق سميج, مركز صيانة غسالات أطباق سميج, خدمة العملاء غسالة أطباق سميج, ضمان غسالة أطباق سميج, تصليح غسالات أطباق سميج, قطع غيار غسالات أطباق سميج, مشاكل غسالة أطباق سميج, تنظيف غسالة أطباق سميج, صيانة غسالات الأطباق سميج المنزلي, استبدال قطع غسالة أطباق سميج, خدمة عملاء سميج, دعم فني سميج, قطع غيار سميج, تصليح أجهزة سميج, خدمات صيانة منزلية, ضمان أجهزة سميج, الخط الساخن أجهزة سميج, صيانة متكاملة لأجهزة سميج, استفسارات صيانة أجهزة سميج, تقديم شكوى لصيانة سميج, خدمات إصلاح سميج, تقييم خدمة عملاء سميج.",
  author: "اسم الشركة أو المركز",
  robots: "index, follow",
  viewport: "width=device-width, initial-scale=1.0",
};

export default function RootLayout({ children }) {
  return (
    <html lang="en">
      <head>


        <link
          rel="stylesheet"
          href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.0.0-beta3/css/all.min.css"
        />

        <link rel="stylesheet" href="https://unpkg.com/aos@next/dist/aos.css" />

      </head>

      <body className=" bg-gradient-to-r from-black to-white ">
        <Bar></Bar>
        {children}
        <Footer></Footer>



        <script src="https://cdn.jsdelivr.net/npm/flowbite@2.5.2/dist/flowbite.min.js"></script>


        <script src="https://unpkg.com/aos@next/dist/aos.js"></script>
        <script>
          AOS.init();
        </script>

      </body>
    </html>
  );
}
